Revit 2024 API
UIDocument.Document Property
Returns the database level document represented by this UI-level document.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public Document Document { get; }
Visual Basic
Public ReadOnly Property Document As Document
	Get
Visual C++
public:
property Document^ Document {
	Document^ get ();
}
See Also
UIDocument Class
Autodesk.Revit.UI Namespace